# Stairs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Stairs Properties
Stairs Class See Also
---
The Stairs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ActualRiserHeight | The actual height of the stairs risers in the stairs. |
| ActualRisersNumber | The total number of actually created risers in model. |
| ActualTreadDepth | The actual depth of the stairs treads in the stairs, actual tread depth is equal to minimum tread depth by default. |
| ActualTreadsNumber | The number of treads actually created in the stairs. |
| AssemblyInstanceId | The id of the assembly instance to which the element belongs.  (Inherited from Element.) |
| BaseElevation | The base elevation of the stairs. |
| BoundingBox | Retrieves a box that circumscribes all geometry of the element. (Inherited from Element.) |
| Category | Retrieves a Category object that represents the category or sub category in which the element resides. (Inherited from Element.) |
| CreatedPhaseId | Id of a Phase at which the Element was created.  (Inherited from Element.) |
| DemolishedPhaseId | Id of a Phase at which the Element was demolished.  (Inherited from Element.) |
| DesignOption | Returns the design option to which the element belongs. (Inherited from Element.) |
| DesiredRisersNumber | The number of risers is calculated based on the height between levels. |
| Document | Returns the Document in which the Element resides. (Inherited from Element.) |
| Geometry | Retrieves the geometric representation of the element. (Inherited from Element.) |
| GroupId | The id of the group to which an element belongs.  (Inherited from Element.) |
| Height | The height of the stair between the base and top levels. |
| Id | A unique identifier for an Element in an Autodesk Revit project.  (Inherited from Element.) |
| IsModifiable | Identifies if the element is modifiable.  (Inherited from Element.) |
| IsTransient | Indicates whether an element is transient or permanent.  (Inherited from Element.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from Element.) |
| LevelId | The id of the level associated with the element.  (Inherited from Element.) |
| Location | This property is used to find the physical location of an element within a project. (Inherited from Element.) |
| MultistoryStairsId | The id of the MultistoryStairs element to which this element belongs. If this stairs element is not a member of a MultistoryStairs element, this will be InvalidElementId. |
| Name | A human readable name for the Element. (Inherited from Element.) |
| NumberOfStories | The number of stories of a multi-story stair, or 1 for a single-story stair. |
| OwnerViewId | The id of the view that owns the element.  (Inherited from Element.) |
| [Parameter[([( Guid])]) ](2e852bc4-46c6-5598-cc45-0eaf38cf8973.md "Parameter Property \(Guid\)") | Retrieves a parameter from the element given a GUID for a shared parameter. (Inherited from Element.) |
| [Parameter[([( BuiltInParameter])]) ](2f91a9f3-7f69-72f9-08d6-a2d71dfb33db.md "Parameter Property \(BuiltInParameter\)") | Retrieves a parameter from the element given a parameter id. (Inherited from Element.) |
| [Parameter[([( Definition])]) ](87d8a88c-906e-85a9-f575-f263788b8584.md "Parameter Property \(Definition\)") | Retrieves a parameter from the element based on its definition. (Inherited from Element.) |
| Parameters | Retrieves a set containing all of the parameters that are contained within the element. (Inherited from Element.) |
| ParametersMap | Retrieves a map containing all of the parameters that are contained within the element. (Inherited from Element.) |
| Pinned | Identifies if the element has been pinned to prevent changes.  (Inherited from Element.) |
| TopElevation | The top elevation of the stairs. |
| UniqueId | A stable unique identifier for an element within the document.  (Inherited from Element.) |
| VersionGuid | Get the element version Guid.  (Inherited from Element.) |
| ViewSpecific | Identifies if the element is owned by a view.  (Inherited from Element.) |
| WorksetId | Get Id of the Workset which owns the element.  (Inherited from Element.) |

# See Also
Stairs Class
Autodesk.Revit.DB.Architecture Namespace